package day11;

public class Ex03 {
	String[] names = {
			"제니", "리사", "로제", "지수", "아이유",
			"경욱", "태윤", "우영", "경민", "혁주"
	};
	public Ex03() {
		// 학생 10 명을 기억할 배열
		Student[] stud = new Student[10];
		
		// 10명의 국어점수를 기억할 배열을 만들고 점수를 랜덤하게 채우세요
		int[] gg = new int[10];
		// 10명의 영어점수를 기억할 배열을 만들고 점수를 랜덤하게 채우세요
		
		// 10명의 수학점수를 기억할 배열을 만들고 점수를 랜덤하게 채우세요
		
		// 10명의 총점을 기억할 배열을 만들고 위의 배열에 기억한 점수로 계산해서 채워 넣으세요.
		
		// 10명의 평균을 기억할 배열을 만들고 위의 총점배열에서 기억한 총점으로 계산해서 입력하세요.
		
		// 학생배열에 각 데이터를 채워넣으세요.
		
		// 학생배열의 데이터를 출력하세요.
		
	}

	public static void main(String[] args) {
		new Ex03();
	}

}